1_snappy_pipe/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    movingWall
    {
        type            patch;
        nFaces          2000;
        startFace       115600;
    }
    leftSide
    {
        type            patch;
        nFaces          2000;
        startFace       117600;
    }
    rightSide
    {
        type            patch;
        nFaces          2000;
        startFace       119600;
    }
    fixedWall
    {
        type            patch;
        nFaces          2000;
        startFace       121600;
    }
    frontAndBack
    {
        type            patch;
        nFaces          800;
        startFace       123600;
    }
)

// ************************************************************************* //
